
                    <div v-pre=""><p>&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x8BA8;&#x8BBA;&#x751F;&#x4EA7;&#x529B;&#x7684;&#x6587;&#x7AE0;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x51E0;&#x4E4E;&#x5168;&#x662F;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5F88;&#x96BE;&#x770B;&#x5230;&#x9879;&#x76EE;&#x7BA1;&#x7406; App&#x3002;</p>
<p>&#x7518;&#x7279;&#x56FE;&#x5C31;&#x662F;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x88AB;&#x4EBA;&#x4ECB;&#x7ECD;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x6709;&#x529B;&#x751F;&#x4EA7;&#x529B;&#x5DE5;&#x5177;&#x3002;&#x901A;&#x8FC7;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x53EF;&#x4EE5;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x91CC;&#x9762;&#x7684;&#x5404;&#x4E2A;&#x4EFB;&#x52A1;&#x5206;&#x522B;&#x4ECE;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7ED3;&#x675F;&#xFF0C;&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x662F;&#x5426;&#x6709;&#x65F6;&#x95F4;&#x91CD;&#x53E0;&#x548C;&#x4F9D;&#x8D56;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x505A;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x5FC5;&#x9700;&#x6709;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x7518;&#x7279;&#x56FE;&#x6765;&#x89C4;&#x5212;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x7684;&#x751F;&#x4EA7;&#x529B;&#x8FDB;&#x5165;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#x3002;</p>
<h2 id="ss-2-1515665010167">&#x4EC0;&#x4E48;&#x662F;&#x7518;&#x7279;&#x56FE;</h2>
<p>&#x4EC0;&#x4E48;&#x662F;&#x7518;&#x7279;&#x56FE;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x5C31;&#x662F;&#x7518;&#x7279;&#x56FE;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-094735.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-094735.jpg"></figure><p></p>
<p>&#x8FD9;&#x5F20;&#x56FE;&#x662F;&#x6211; 12 &#x6708;&#x79BB;&#x804C;&#x505A;&#x4EA4;&#x63A5;&#x65F6;&#x5019;&#x7684;&#x7518;&#x7279;&#x56FE;&#x3002;</p>
<ul>
<li>&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;</li>
<li>&#x6BCF;&#x4E00;&#x884C;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;</li>
<li>&#x7EA2;&#x8272;&#x7AD6;&#x7EBF;&#x8868;&#x793A;&#x4ECA;&#x5929;&#x5E94;&#x8BE5;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;</li>
<li>&#x4EFB;&#x52A1;&#x4E0E;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x9ED1;&#x8272;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5FC5;&#x9700;&#x5B8C;&#x6210;&#x524D;&#x9762;&#x7684;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x540E;&#x9762;&#x7684;</li>
<li>&#x5E26;&#x4E2D;&#x5FC3;&#x9ED1;&#x7EBF;&#x7684;&#x4EFB;&#x52A1;&#x8868;&#x793A;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;</li>
</ul>
<p>&#x901A;&#x8FC7;&#x8FD9;&#x4E00;&#x5F20;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x6211;&#x80FD;&#x4E00;&#x773C;&#x770B;&#x51FA;&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#xFF1A;</p>
<ol>
<li>&#x4ECA;&#x5929;&#x8C01;&#x5E94;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x4EFB;&#x52A1;</li>
<li>&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x4ECE;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#xFF0C;&#x5230;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7ED3;&#x675F;</li>
<li>&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6709;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;</li>
<li>&#x5E94;&#x8BE5;&#x5148;&#x505A;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x518D;&#x505A;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;</li>
<li>&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x505A;</li>
<li>&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x662F;&#x5426;&#x88AB;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x4F9D;&#x8D56;&#xFF0C;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x5C31;&#x4E0D;&#x80FD;&#x63A8;&#x8FDF;&#xFF0C;&#x5FC5;&#x9700;&#x6309;&#x65F6;&#x5B8C;&#x6210;&#x6216;&#x8005;&#x63D0;&#x524D;&#x5B8C;&#x6210;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5F71;&#x54CD;&#x540E;&#x9762;&#x7684;&#x4EFB;&#x52A1;</li>
<li>&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x591A;&#x5C11;&#x8FD8;&#x5269;&#x591A;&#x5C11;</li>
<li>&#x5927;&#x4EFB;&#x52A1;&#x4E0B;&#x9762;&#x6709;&#x54EA;&#x4E9B;&#x5B50;&#x4EFB;&#x52A1;</li>
<li>&#x4EFB;&#x52A1;&#x7684;&#x91CC;&#x7A0B;&#x7891;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;</li>
</ol>
<h2 id="ss-2-1515665010168">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;&#x7518;&#x7279;&#x56FE;</h2>
<p>&#x4F7F;&#x7528;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x53EF;&#x4EE5;&#x514B;&#x670D;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x7684;&#x51E0;&#x4E2A;&#x7F3A;&#x9677;&#x3002;</p>
<p>&#x5C11;&#x6570;&#x6D3E;&#x7684;&#x6587;&#x7AE0;&#x559C;&#x6B22;&#x4ECB;&#x7ECD;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4E5F;&#x559C;&#x6B22;&#x7528;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x3002;&#x4EFB;&#x52A1;&#x7BA1;&#x7406; App&#xFF0C;&#x66F4;&#x662F;&#x591A;&#x4E0D;&#x80DC;&#x6570;&#xFF0C;&#x5E38;&#x89C1;&#x7684; Things 3&#x3001;Todoist&#x3001;Any.do&#x3001;Teambition&#x3001;Trello&#x2026;&#x2026;&#x5176;&#x4E2D; Things 3 &#x548C; Todoist&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x589E;&#x5F3A;&#x7248;&#x7684;&#x63D0;&#x9192;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;&#x586B;&#x4E0A;&#x53BB;&#xFF0C;&#x8BBE;&#x7F6E;&#x597D; Deadline&#xFF0C;&#x4E8B;&#x60C5;&#x505A;&#x5B8C;&#x4E86;&#x52FE;&#x6389;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-094938.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-094938.jpg"></figure><p></p>
<p>&#x4F46;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684; App &#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x2014;&#x2014;&#x4EFB;&#x52A1;&#x53EA;&#x6709; <code>&#x672A;&#x505A;</code> &#x548C; <code>&#x5B8C;&#x6210;</code> &#x4E24;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x6CA1;&#x6709; <code>&#x6B63;&#x5728;&#x505A;</code> &#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x800C; Teambition &#x4E0E; Trello &#x7A0D;&#x5FAE;&#x8FDB;&#x6B65;&#x4E00;&#x70B9;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x770B;&#x677F;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E8E;&#x662F;&#x80FD;&#x591F;&#x663E;&#x793A;&#x4EFB;&#x52A1;&#x5728;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x8FD9;&#x5F20;&#x56FE;&#x662F;&#x5C11;&#x6570;&#x6D3E;&#x7684; Trello &#x770B;&#x677F;&#xFF0C;&#x7528;&#x6765;&#x8BA9;&#x4F5C;&#x8005;&#x9009;&#x9898;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-094950.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-094950.jpg"></figure><p></p>
<p>&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684; App &#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x4F60;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x505A;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x662F;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x7C7B; App &#x9002;&#x5408;&#x7528;&#x6765;&#x8BB0;&#x5F55;&#x548C;&#x8FFD;&#x8E2A;&#x5404;&#x79CD;&#x7410;&#x788E;&#x7684;&#x4EFB;&#x52A1;&#x548C;&#x76F8;&#x5173;&#x6027;&#x4E0D;&#x5F3A;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5C31;&#x50CF;&#x662F;&#x5C11;&#x6570;&#x6D3E;&#x7684;&#x6BCF;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6587;&#x7AE0;&#x4E0E;&#x6587;&#x7AE0;&#x4E4B;&#x95F4;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4ED6;&#x4EEC;&#x5404;&#x81EA;&#x72EC;&#x7ACB;&#xFF0C;&#x8C01;&#x90FD;&#x53EF;&#x4EE5;&#x9886;&#x9009;&#x9898;&#x5199;&#x6587;&#x7AE0;&#xFF0C;&#x54EA;&#x4E2A;&#x9009;&#x9898;&#x5148;&#x5199;&#x54EA;&#x4E2A;&#x9009;&#x9898;&#x540E;&#x5199;&#xFF0C;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x8981;&#x89C4;&#x5212;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5BF9;&#x4E8E;&#x89C4;&#x5212;&#x9879;&#x76EE;&#x7684;&#x4EBA;&#x548C;&#x505A;&#x9879;&#x76EE;&#x7684;&#x4EBA;&#xFF0C;&#x7528;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x7C7B; App &#x90FD;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x4F7F;&#x4E0D;&#x4E0A;&#x52B2;&#x3002;&#x5BF9;&#x4E8E;&#x505A;&#x4EFB;&#x52A1;&#x7684;&#x4EBA;&#xFF0C;&#x770B;&#x5230;&#x6BCF;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5BF9;&#x9879;&#x76EE;&#x6CA1;&#x6709;&#x6574;&#x4F53;&#x7684;&#x6982;&#x5FF5;&#xFF1B;&#x5BF9;&#x4E8E;&#x89C4;&#x5212;&#x9879;&#x76EE;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4EFB;&#x52A1;&#x662F;&#x4E0D;&#x662F;&#x5DF2;&#x7ECF;&#x5207;&#x5206;&#x5F97;&#x8DB3;&#x591F;&#x7EC6;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x9057;&#x6F0F;&#x3002;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#xFF1A;</p>
<ul>
<li>&#x627E; IT &#x7533;&#x8BF7;&#x670D;&#x52A1;&#x5668;</li>
<li>&#x914D;&#x7F6E; Dockerfile</li>
<li>&#x914D;&#x7F6E; Docker Swarm</li>
<li>&#x642D;&#x5EFA; Jenkins</li>
<li>&#x914D;&#x7F6E; Github Hook</li>
<li>&#x9009;&#x62E9;&#x4E09;&#x4E2A; Repo &#x6D4B;&#x8BD5;</li>
</ul>
<p>&#x73B0;&#x5728;&#x770B;&#x5230;&#x4E0A;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x6211;&#x662F;&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;&#x6211;&#x60F3;&#x5B9E;&#x73B0;&#x6301;&#x7EED;&#x96C6;&#x6210;&#xFF08;CI&#xFF09;&#xFF0C;&#x5B9E;&#x73B0;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x628A;&#x4EE3;&#x7801;&#x4E00;&#x63A8;&#x5230; Github&#xFF0C;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x4F7F;&#x7528; Jenkins &#x628A;&#x4EE3;&#x7801;&#x62C9;&#x5230;&#x6D4B;&#x8BD5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x68C0;&#x67E5;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#xFF0C;&#x505A;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x505A;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x81EA;&#x52A8;&#x751F;&#x6210; Code Review &#x7533;&#x8BF7;&#x53D1;&#x9001;&#x7ED9;&#x76F8;&#x5173;&#x4EBA;&#x5458;&#xFF0C;Code Review &#x4EE5;&#x540E;&#x81EA;&#x52A8;&#x628A;&#x4EE3;&#x7801;&#x96C6;&#x6210;&#x5230;&#x4E3B;&#x5E72;&#x5E76;&#x90E8;&#x7F72;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x505A;&#x4EFB;&#x52A1;&#x7684;&#x4EBA;&#xFF0C;&#x5374;&#x5F88;&#x96BE;&#x6839;&#x636E;&#x4E0A;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#x53D1;&#x73B0;&#x8981;&#x505A;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x3002;&#x5BF9;&#x4E8E;&#x89C4;&#x5212;&#x4EFB;&#x52A1;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x53D1;&#x73B0;&#x662F;&#x5426;&#x6F0F;&#x6389;&#x4E86;&#x4EFB;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x62C6;&#x5206;&#x3002;</p>
<p>&#x518D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x8BBE;&#x5B9A;&#x65F6;&#x95F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EFB;&#x52A1;&#x4E00;&#x65E6;&#x591A;&#xFF0C;&#x5F88;&#x96BE;&#x628A;&#x63A7;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x5177;&#x4F53;&#x65F6;&#x957F;&#x3002;&#x4E5F;&#x96BE;&#x4EE5;&#x53D1;&#x73B0;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x505A;&#xFF0C;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x6709;&#x4F9D;&#x8D56;&#x5FC5;&#x9700;&#x5148;&#x505A;&#x8FD9;&#x4E2A;&#x518D;&#x505A;&#x90A3;&#x4E2A;&#xFF0C;&#x524D;&#x7F6E;&#x4EFB;&#x52A1;&#x5FC5;&#x9700;&#x6309;&#x65F6;&#x5B8C;&#x6210;&#x3002;&#x5373;&#x4F7F;&#x8BBE;&#x7F6E;&#x4E86;&#x4EFB;&#x52A1;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x540C;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x8C01;&#x5148;&#x505A;&#x8C01;&#x540E;&#x505A;&#xFF0C;&#x4F60;&#x5374;&#x65E0;&#x6CD5;&#x628A;&#x63A7;&#xFF0C;&#x53EA;&#x6709;&#x770B; App &#x4E0A;&#x54EA;&#x4E2A;&#x6392;&#x524D;&#x9762;&#x5C31;&#x5148;&#x505A;&#x54EA;&#x4E2A;&#x3002;</p>
<p>&#x6211;&#x66FE;&#x7ECF;&#x6709;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x8003;&#x8651;&#x5230; Teambition &#x7684;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x628A; Teambition &#x4E0E;&#x5927;&#x7EB2;&#x5DE5;&#x5177; Workflowy &#x7ED3;&#x5408;&#x8D77;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x6587;&#x7AE0;&#x5730;&#x5740;&#x4E3A;&#xFF1A;<a href="https://sspai.com/post/41178" title="TeamFlowy&#x2014;&#x2014;&#x7ED3;&#x5408; Teambition &#x4E0E; Workflowy">TeamFlowy&#x2014;&#x2014;&#x7ED3;&#x5408; Teambition &#x4E0E; Workflowy</a></p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x514B;&#x670D;&#x4EFB;&#x52A1;&#x7BA1;&#x7406; App &#x7684;&#x8FD9;&#x4E9B;&#x7F3A;&#x9677;&#x3002;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x7ED8;&#x5236;&#x51FA;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x4F60;&#x5FC5;&#x9700;&#x5F3A;&#x8FEB;&#x81EA;&#x5DF1;&#x5B8C;&#x6210;&#x4EE5;&#x4E0B;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ol>
<li>&#x786E;&#x5B9A;&#x6BCF;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x548C;&#x7ED3;&#x675F;&#x65F6;&#x95F4;</li>
<li>&#x786E;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</li>
<li>&#x5206;&#x79BB;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;</li>
<li>&#x786E;&#x5B9A;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x4EFB;&#x52A1;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x5173;&#x7CFB;</li>
</ol>
<p>&#x5F53;&#x4F60;&#x6839;&#x636E;&#x4EE5;&#x4E0A;&#x7684;&#x89C4;&#x5219;&#x7ED8;&#x5236;&#x597D;&#x7B2C;&#x4E00;&#x7248;&#x7518;&#x7279;&#x56FE;&#x4EE5;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x662F;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x8C03;&#x6574;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x8C03;&#x6574;&#xFF0C;&#x5728;&#x4F60;&#x6CA1;&#x6709;&#x753B;&#x56FE;&#x4E4B;&#x524D;&#x662F;&#x4E0D;&#x80FD;&#x53D1;&#x73B0;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x4F60;&#x4F1A;&#x5728;&#x8C03;&#x6574;&#x7518;&#x7279;&#x56FE;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BA9;&#x9879;&#x76EE;&#x7684;&#x89C4;&#x5212;&#x8D8A;&#x6765;&#x8D8A;&#x6E05;&#x6670;&#x3002;</p>
<h2 id="ss-2-1515665010168">&#x600E;&#x4E48;&#x505A;&#x7518;&#x7279;&#x56FE;</h2>
<p>&#x7ED8;&#x5236;&#x7518;&#x7279;&#x56FE;&#x4E0D;&#x4E00;&#x5B9A;&#x9700;&#x8981; App&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7EB8;&#x4E0A;&#x505A;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528; Excel &#x6765;&#x505A;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x662F;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095012.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095012.jpg"></figure><p></p>
<p>&#x8FD9;&#x662F;&#x4F7F;&#x7528; Excel &#x505A;&#x51FA;&#x6765;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x505A;&#x8D77;&#x6765;&#x7A0D;&#x663E;&#x9EBB;&#x70E6;&#x3002;</p>
<p>OmniPlan &#x548C; MS Project &#x90FD;&#x662F;&#x975E;&#x5E38;&#x4E13;&#x4E1A;&#x7684;&#x7518;&#x7279;&#x56FE;&#x5236;&#x4F5C;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x4EF7;&#x683C;&#x975E;&#x5E38;&#x9AD8;&#x3002;&#x6BD5;&#x7ADF;&#x8FD9;&#x662F;&#x751F;&#x4EA7;&#x529B;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x4F60;&#x662F;&#x53EF;&#x4EE5;&#x8D5A;&#x5927;&#x94B1;&#x7684;&#xFF0C;&#x81EA;&#x7136;&#x8F6F;&#x4EF6;&#x672C;&#x8EAB;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x8D35;&#x3002;</p>
<p>&#x5F00;&#x6E90;&#x7684;&#x7518;&#x7279;&#x56FE;&#x8F6F;&#x4EF6;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x662F;&#x529F;&#x80FD;&#x4E0D;&#x5168;&#x5C31;&#x662F;&#x754C;&#x9762;&#x4E11;&#x964B;&#x3002;&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5B8C;&#x6574;&#x7684;&#x7518;&#x7279;&#x56FE;&#x5236;&#x4F5C;&#x8F6F;&#x4EF6;&#xFF1A;GanttProject&#xFF0C;&#x9664;&#x4E86;&#x957F;&#x7684;&#x6BD4;&#x8F83;&#x4E11;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x9762; GanttProject &#x5F88;&#x597D;&#x7528;&#x3002;</p>
<p>GanttProject &#x7684;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x4E3A; <a href="http://www.ganttproject.biz/" title="ganttproject.biz">ganttproject.biz</a>&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x5230; macOS&#x3001;Windows &#x6216;&#x8005; Linux &#x7248;&#x672C;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>GanttProject &#x8FD0;&#x884C;&#x4EE5;&#x540E;&#x7684;&#x754C;&#x9762;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095021.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095021.jpg"></figure><p></p>
<p>&#x5728;&#x5DE6;&#x4FA7;&#x4EFB;&#x52A1;&#x9762;&#x677F;&#x53F3;&#x952E;&#x6216;&#x8005;&#x6309;&#x4E0B;&#x952E;&#x76D8; <code>Command</code> + <code>T</code> &#x5C31;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4EFB;&#x52A1;&#xFF0C;Windows &#x548C; Linux &#x5BF9;&#x5E94;&#x7684;&#x5FEB;&#x6377;&#x952E;&#x4E3A; <code>Ctrl</code> + <code>T</code>&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095030.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095030.jpg"></figure><p></p>
<p>&#x521B;&#x5EFA;&#x597D;&#x4E86;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5B83;&#x9ED8;&#x8BA4;&#x7684;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x548C;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x4ECA;&#x5929;&#x3002;&#x5728;&#x4EFB;&#x52A1;&#x4E0A;&#x9762;&#x53F3;&#x952E;&#xFF0C;&#x9009;&#x62E9; <code>&#x4EFB;&#x52A1;&#x5C5E;&#x6027;</code>&#xFF0C;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x4EFB;&#x52A1;&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x754C;&#x9762;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4EFB;&#x52A1;&#x7684;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x548C;&#x4EFB;&#x52A1;&#x65F6;&#x957F;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x80FD;&#x8BBE;&#x7F6E;&#x4EFB;&#x52A1;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x4E3A;&#x4EFB;&#x52A1;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#x4F1A;&#x6839;&#x636E;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x548C;&#x4EFB;&#x52A1;&#x65F6;&#x957F;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095039.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095039.jpg"></figure><p></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x754C;&#x9762;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4EFB;&#x52A1;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x4EBA;&#x4E0D;&#x540C;&#x989C;&#x8272;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x540C;&#x9879;&#x76EE;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x66F4;&#x65B0;&#x4EFB;&#x52A1;&#x8FDB;&#x5EA6;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x540E;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#x4F9D;&#x8D56;&#x524D;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x53F3;&#x4FA7;&#x88AB;&#x4F9D;&#x8D56;&#x7684;&#x4EFB;&#x52A1;&#x8272;&#x6761;&#x4E0A;&#x5355;&#x51FB;&#x9F20;&#x6807;&#x5DE6;&#x952E;&#xFF0C;&#x6309;&#x4F4F;&#x5E76;&#x62D6;&#x52A8;&#x5230;&#x4F9D;&#x8D56;&#x5B83;&#x7684;&#x4EFB;&#x52A1;&#x4E0A;&#x3002;&#x4F9D;&#x8D56;&#x5B83;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x8D77;&#x59CB;&#x65F6;&#x95F4;&#x81EA;&#x52A8;&#x5C31;&#x4F1A;&#x53D8;&#x4E3A;&#x88AB;&#x4F9D;&#x8D56;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x540E;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x53EA;&#x80FD;&#x8BBE;&#x7F6E;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x957F;&#xFF0C;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x4EFB;&#x52A1;&#x7684;&#x8D77;&#x59CB;&#x65F6;&#x95F4;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095048.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095048.jpg"></figure><p></p>
<p>&#x5982;&#x679C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x8BBE;&#x7F6E;&#x9519;&#x8BEF;&#xFF0C;&#x6253;&#x5F00;&#x4F9D;&#x8D56;&#x4EFB;&#x52A1;&#x7684;&#x4EFB;&#x52A1;&#x5C5E;&#x6027;&#xFF0C;&#x5B9A;&#x4F4D;&#x5230; <code>&#x524D;&#x7F6E;&#x4EFB;&#x52A1;</code> &#x9009;&#x9879;&#x5361;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x88AB;&#x4F9D;&#x8D56;&#x7684;&#x4EFB;&#x52A1;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x88AB;&#x4F9D;&#x8D56;&#x4EFB;&#x52A1;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095055.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095055.jpg"></figure><p></p>
<p>&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x4EFB;&#x52A1;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x9F20;&#x6807;&#x5355;&#x51FB;&#x9009;&#x4E2D;&#x5B83;&#xFF0C;&#x6309;&#x4E0B;&#x952E;&#x76D8;&#x4E0A;&#x7684; <code>Alt</code> + <code>&#x65B9;&#x5411;&#x952E;&#x4E0A;&#x6216;&#x4E0B;</code> &#x5373;&#x53EF;&#x79FB;&#x52A8;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x7518;&#x7279;&#x56FE;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5C31;&#x662F;&#x7AD6;&#x76F4;&#x7EA2;&#x7EBF;&#xFF0C;&#x5B83;&#x6307;&#x5411;&#x4E86;&#x4ECA;&#x5929;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x8981;&#x6253;&#x5F00;&#x8FD9;&#x8DDF;&#x7EA2;&#x7EBF;&#xFF0C;&#x9700;&#x8981;&#x5355;&#x51FB;&#x83DC;&#x5355;&#x680F;&#x7684; <code>&#x7F16;&#x8F91;</code> - <code>&#x8BBE;&#x7F6E;</code>&#xFF0C;&#x5B9A;&#x4F4D;&#x5230; <code>&#x7518;&#x7279;&#x56FE;&#x8BBE;&#x5B9A;</code>&#xFF0C;&#x5728; <code>&#x5C06;&#x4ECA;&#x5929;&#x663E;&#x793A;&#x4E3A;&#x7EA2;&#x8272;</code> &#x70B9;&#x9009;&#x4E3A; <code>&#x662F;</code>&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095105.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095105.jpg"></figure><p></p>
<p>&#x5355;&#x51FB;&#x786E;&#x5B9A;&#x56DE;&#x5230;&#x7518;&#x7279;&#x56FE;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x56FE;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x6761;&#x7EA2;&#x8272;&#x7AD6;&#x7EBF;&#x3002;&#x8FD9;&#x6761;&#x7AD6;&#x7EBF;&#x6307;&#x5411;&#x4E86;&#x4ECA;&#x5929;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095113.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095113.jpg"></figure><p></p>
<p>&#x6BCF;&#x5929;&#x6253;&#x5F00;&#x7518;&#x7279;&#x56FE;&#xFF0C;&#x8FD9;&#x6839;&#x7EA2;&#x7EBF;&#x90FD;&#x4F1A;&#x6307;&#x5411;&#x5F53;&#x5929;&#x3002;</p>
<p>GanttProject &#x53EF;&#x4EE5;&#x628A;&#x505A;&#x597D;&#x7684;&#x7518;&#x7279;&#x56FE;&#x5BFC;&#x51FA;&#x4E3A;&#x56FE;&#x7247;&#xFF0C;CSV&#x3001;HTML &#x6216;&#x8005; PDF &#x6587;&#x4EF6;&#x3002;&#x5355;&#x51FB; <code>&#x9879;&#x76EE;</code> - <code>&#x5BFC;&#x51FA;</code>&#xFF0C;&#x70B9;&#x9009; <code>Raster&#x56FE;&#x50CF;&#x6587;&#x4EF6;</code>&#xFF0C;&#x5E76;&#x5355;&#x51FB; <code>&#x4E0B;&#x4E00;&#x6B65;</code>&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p></p><figure tabindex="0" class="ss-img-wrapper"><img src="https://cdn.sspai.com/2018-01-11-095121.jpg?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="null" data-original="https://cdn.sspai.com/2018-01-11-095121.jpg"></figure><p></p>
<p>&#x8BBE;&#x7F6E;&#x4FDD;&#x5B58;&#x8DEF;&#x5F84;&#x548C;&#x7518;&#x7279;&#x56FE;&#x7684;&#x65E5;&#x671F;&#x8303;&#x56F4;&#x5373;&#x53EF;&#x5BFC;&#x51FA;&#x4E3A; PNG &#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x5206;&#x4EAB;&#x3002;</p>
<p>GanttProject &#x8FD8;&#x6709;&#x66F4;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x4EE5;&#x540E;&#x6162;&#x6162;&#x7814;&#x7A76;&#x3002;</p>
</div>
                  